import React, { Component } from 'react'

class Main extends Component {
    render () {
        return (
            <div>
                <h1>Главная страница</h1>
                <p>Тут будет просто главная страница сайта. Запихнем сюда поисковик ну и рандомный список товаров подгружаемый из БД.</p>
                <p>Это только логика архитектуры SPA. Тут не хватает AJAX запросов, JSON, стилей и еще много чего. Маршутизация роутера написана на 3й версии и будет переписана на современную 5ю! Так что работы впереди еще очень много. Надеюсь своей работой я вложил хоть какой то старт и вам уже есть хоть с чем то работать!..</p>
            </div>
        )
    }
}

export default Main